#include "../lib/Classes.h"

// Пофіксити:
// - при виводі через std::cout не можна використовувати методи користувацьких класів (те ж саме при використанні return)
// зробити перевірку на коректність вводу данних користувача в main


// Написати програму яка буде знаходи Нормальну Жорданову Форму Матриці, отримуючи на вхід тільки матриці лінійного оператора
// Написати клас Matrix, Frac (математичні дроби) та їх відповідні методи
// Описати роботу програми із змінними (знаходження власно числа) та в системі лінійних рівнянь



int main() {

    // Ранг мариці
    // Ядро та образ лінійного оператора
    // Розв'язок СЛАР методом Крамара + загальний розв'язоу системи
    // базис суми та перетину підпросторів
    // Заміна базису / матриці переходу
    // Координати вектора в іншому базисі
    // Матриця лінійного оператора в іншому базисі
    // Знайти власні числа та власні вектори
    // Нормальна форма Жодана + пошук функції
    // Процес ортогоналіції Грамма-Шміта + ортонормація
    // Перевірка на пряму суму просторів
    // Ортогональне доповнення
    // Знаходження ортогональної проекції та ортогональної складової
    // Знайти матрицю спряженого оператора
    // Побудувати ортонормаваний базис із влачних векторів

    std::cout << "Choose youe language: \nEN - 1 \nUA - 2 \n";
    int language;
    std::cin >> language;
    if (language != 1 && language != 2) {
        std::cout << "Enter correct answer! \n";
        std::cin >> language;
    }
    std::system("clear");

    if (language == 1) {
        // eng translate
    }
    else {
        std::cout << "Вибири свою задачу: \n"
            "1) перевірити систему на ЛНЗ \n"
            "2) Вирішити СЛАР методлм Гауса \n"
            "3) знайти детермінант \n"
            "4) знайти базис \n"
            "5) знайти обернену матрицю \n";
    }
    int task;
    std::cin >> task;
    std::system("clear");

    switch (task) {
        case 1: {

        }; break;
        case 2: {

        } break;
        case 3: {

        }; break;
        case 4: {

        } break;
        case 5: {

        } break;
    }

    std::cout << "\n";
    return 0;
}
